In [ ]:
"""
Nth Highest Salary

Write a SQL query to get the nth highest salary from the Employee table.
If there is no nth highest salary, then the query should return null.

Extended problem from LC0176
"""

In [ ]:
"""testcase"""
{"headers": {"Employee": ["Id", "Salary"]}, "argument": 2, "rows": {"Employee": [[1, 100], [2, 100], [3, 50], [4, 50]]}}

In [ ]:
"""SQL table creation and data insertion"""
DROP TABLE IF EXISTS Employee;

CREATE TABLE Employee(
Id  int(4) NOT NULL,
Salary int(8) NOT NULL
PRIMARY KEY ('Id'));

INSERT INTO Person VALUES
(1, 100),
(2, 100),
(3, 50),
(4, 50);

In [ ]:
"""SQL solution"""
CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
  RETURN (
      # Write your MySQL query statement below.
      SELECT
      (SELECT Salary
      FROM
      (SELECT Salary, DENSE_RANK() OVER(ORDER BY Salary DESC) AS r
      FROM Employee) AS f
      WHERE f.r = N
      LIMIT 1) AS NthHighestSalary
  );
END

CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
BEGIN
  RETURN (
      # Write your MySQL query statement below.
      SELECT DISTINCT Salary
      FROM
      (SELECT Salary, DENSE_RANK() OVER(ORDER BY Salary DESC) AS r
      FROM Employee) AS f
      WHERE f.r = N
  );
END

# in function the default return is null, no need to handle null like in LC0176

In [1]:
"""pandas dataframe creation"""
import pandas as pd

emp = [(1, 100),
(2, 100),
(3, 50),
(4, 50)]

Employee = pd.DataFrame(emp, columns=['Id', 'Salary'])
Employee.head()

   Id  Salary
0   1     100
1   2     100
2   3      50
3   4      50

In [2]:
def NthHighestSalary(df, n):
    df['sal_rank'] = df['Salary'].rank(method='dense', ascending=False)
    ans = df[df['sal_rank'] == n]['Salary'].mean()
    if pd.isna(ans):
        return 'null'
    else:
        return ans

In [4]:
print(NthHighestSalary(Employee, 1))
print(NthHighestSalary(Employee, 2))
print(NthHighestSalary(Employee, 4))

100.0
50.0
null